; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   blue_block_1 black_block_1 blue_block_2 blue_block_3 white_block_1 white_block_2 brown_block_1 - block
 )
 (:init (ontable blue_block_1) (ontable black_block_1) (ontable blue_block_2) (on blue_block_3 black_block_1) (ontable white_block_1) (on white_block_2 blue_block_2) (ontable brown_block_1) (clear blue_block_1) (clear blue_block_3) (clear white_block_1) (clear white_block_2) (clear brown_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (holding white_block_1)))
 (:constraints (sometime (not (ontable white_block_1))) (sometime-after (not (ontable white_block_1)) (or (on blue_block_3 white_block_2) (ontable blue_block_3))) (sometime (not (clear white_block_1))) (sometime-before (not (clear white_block_1)) (holding white_block_2)) (sometime (on blue_block_3 white_block_2)) (sometime (or (on white_block_1 blue_block_3) (clear blue_block_2))) (sometime (or (not (ontable brown_block_1)) (on blue_block_3 brown_block_1))) (sometime (not (on brown_block_1 blue_block_2))) (sometime-after (not (on brown_block_1 blue_block_2)) (not (clear brown_block_1))) (sometime (or (not (clear brown_block_1)) (on brown_block_1 white_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack white_block_2 blue_block_2)
   deleted: (on white_block_2 blue_block_2) (clear white_block_2) (handempty)
   added: (holding white_block_2) (clear blue_block_2)
   goals met: 0 of 1
2. (putdown white_block_2)
   deleted: (holding white_block_2)
   added: (clear white_block_2) (handempty) (ontable white_block_2)
   goals met: 0 of 1
3. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1)
   goals met: 0 of 1
4. (stack brown_block_1 blue_block_2)
   deleted: (clear blue_block_2) (holding brown_block_1)
   added: (handempty) (clear brown_block_1) (on brown_block_1 blue_block_2)
   goals met: 0 of 1
5. (unstack blue_block_3 black_block_1)
   deleted: (on blue_block_3 black_block_1) (clear blue_block_3) (handempty)
   added: (holding blue_block_3) (clear black_block_1)
   goals met: 0 of 1
6. (stack blue_block_3 white_block_2)
   deleted: (clear white_block_2) (holding blue_block_3)
   added: (handempty) (clear blue_block_3) (on blue_block_3 white_block_2)
   goals met: 0 of 1
7. (pickup white_block_1)
   deleted: (clear white_block_1) (ontable white_block_1) (handempty)
   added: (holding white_block_1)
   goals met: 1 of 1
